Documents/КорректировкаЕНС/КорректировкаЕНС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаЕНС</name>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийКорректировкиЕНС</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСуммаДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНалог</name>
    <type>
      <types>CatalogRef.ВидыНалоговИПлатежейВБюджет</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидПлатежаВГосБюджет</name>
    <type>
      <types>EnumRef.ВидыПлатежейВГосБюджет</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьУровеньБюджета</name>
    <type>
      <types>EnumRef.УровниБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРегистрацияВНалоговомОргане</name>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПодразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСубконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОснование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СозданАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УвеличениеСальдо</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>УменьшениеСальдо</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Операции</name>
    <attributes>
      <name>ВидОперации</name>
      <type>
        <types>EnumRef.ВидыОперацийКорректировкиЕНС</types>
      </type>
    </attributes>
    <attributes>
      <name>Налог</name>
      <type>
        <types>CatalogRef.ВидыНалоговИПлатежейВБюджет</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокУплаты</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредстоящийПлатеж</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>Основание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчета</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторФНС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПлатежаВГосБюджет</name>
      <type>
        <types>EnumRef.ВидыПлатежейВГосБюджет</types>
      </type>
    </attributes>
    <attributes>
      <name>УровеньБюджета</name>
      <type>
        <types>EnumRef.УровниБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>РегистрацияВНалоговомОргане</name>
      <type>
        <types>CatalogRef.РегистрацииВНалоговомОргане</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Enums/ВидыОперацийКорректировкиЕНС/ВидыОперацийКорректировкиЕНС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийКорректировкиЕНС</name>
  <enumValues>
    <name>НачислениеНалога</name>
  </enumValues>
  <enumValues>
    <name>НачислениеПени</name>
  </enumValues>
  <enumValues>
    <name>НачислениеШтрафа</name>
  </enumValues>
  <enumValues>
    <name>НачислениеПроцентов</name>
  </enumValues>
  <enumValues>
    <name>НачислениеГосПошлины</name>
  </enumValues>
  <enumValues>
    <name>ВозмещениеНалога</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеСредствОтТретьегоЛица</name>
  </enumValues>
  <enumValues>
    <name>ПереводСредствТретьемуЛицу</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеПроцентовОтНалоговогоОргана</name>
  </enumValues>
  <enumValues>
    <name>ПрочееУвеличениеСальдо</name>
  </enumValues>
  <enumValues>
    <name>ПрочееУменьшениеСальдо</name>
  </enumValues>
</mdclass:Enum>

Documents/КорректировкаЕНС/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	НачалоПростогоУчета = ЕдиныйНалоговыйСчет.НачалоПростогоУчета();
	Если Дата < НачалоПростогоУчета Тогда
		 Дата = НачалоПростогоУчета;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	НепроверяемыеРеквизиты.Добавить("Операции.Налог");
	НепроверяемыеРеквизиты.Добавить("Операции.ВидПлатежаВГосБюджет");
	НепроверяемыеРеквизиты.Добавить("Операции.Контрагент");
	
	Для каждого СтрокаОперации Из Операции Цикл
		
		Префикс = "Операции[%1].";
		Префикс = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			Префикс, Формат(СтрокаОперации.НомерСтроки - 1, "ЧН=0; ЧГ="));
		
		ИмяСписка = НСтр("ru = 'Операции'");
		
		
		Если СтрокаОперации.ВидОперации = Перечисления.ВидыОперацийКорректировкиЕНС.НачислениеНалога
			Или СтрокаОперации.ВидОперации = Перечисления.ВидыОперацийКорректировкиЕНС.ВозмещениеНалога Тогда
			Если Не ЗначениеЗаполнено(СтрокаОперации.Налог) Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",, НСтр("ru = 'Налог'"),
					СтрокаОперации.НомерСтроки, ИмяСписка);
				Поле = Префикс + "Налог";
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
			Если Не ЗначениеЗаполнено(СтрокаОперации.ВидПлатежаВГосБюджет) Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",, НСтр("ru = 'Вид платежа в гос бюджет'"),
					СтрокаОперации.НомерСтроки, ИмяСписка);
				Поле = Префикс + "ВидПлатежаВГосБюджет";
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаОперации.ВидОперации = Перечисления.ВидыОперацийКорректировкиЕНС.ПереводСредствТретьемуЛицу
			Или УдалитьВидОперации = Перечисления.ВидыОперацийКорректировкиЕНС.ПоступлениеСредствОтТретьегоЛица Тогда
			Если Не ЗначениеЗаполнено(СтрокаОперации.Контрагент) Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",, НСтр("ru = 'Контрагент'"),
					СтрокаОперации.НомерСтроки, ИмяСписка);
				Поле = Префикс + "Контрагент";
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПроведениеСервер.ГрупповоеПерепроведение(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	УвеличениеСальдо = 0;
	УменьшениеСальдо = 0;
	ВидыОперацийУвеличениеСальдоЕНС = Новый ФиксированныйМассив(Документы.КорректировкаЕНС.ВидыОперацийУвеличениеСальдоЕНС());
	
	Для Каждого Операция Из Операции Цикл
		
		СвойстваСчета = Документы.КорректировкаЕНС.СвойстваСчета(Операция.СчетУчета);
		
		Если Операция.ВидОперации = Перечисления.ВидыОперацийКорректировкиЕНС.НачислениеНалога 
			Или Операция.ВидОперации = Перечисления.ВидыОперацийКорректировкиЕНС.ВозмещениеНалога Тогда
			Если Не СвойстваСчета.ЕстьУровниБюджетов Тогда
					Операция.УровеньБюджета = Неопределено;
			КонецЕсли;
			Если Не СвойстваСчета.ЕстьРегистрацияВНалоговомОргане Тогда
				Операция.РегистрацияВНалоговомОргане = Неопределено;
			КонецЕсли;
		Иначе
			Операция.Налог = Неопределено;
			Операция.ВидПлатежаВГосБюджет = Неопределено;
			Операция.УровеньБюджета = Неопределено;
			Операция.РегистрацияВНалоговомОргане = Неопределено;
			КонецЕсли;
		
		Если Не (Операция.ВидОперации = Перечисления.ВидыОперацийКорректировкиЕНС.ПоступлениеСредствОтТретьегоЛица 
			Или Операция.ВидОперации = Перечисления.ВидыОперацийКорректировкиЕНС.ПереводСредствТретьемуЛицу) Тогда
			Операция.Контрагент = Неопределено;
		КонецЕсли;
		
		Если Не (Операция.ВидОперации = Перечисления.ВидыОперацийКорректировкиЕНС.ПрочееУвеличениеСальдо
			Или Операция.ВидОперации = Перечисления.ВидыОперацийКорректировкиЕНС.ПрочееУменьшениеСальдо) Тогда
			Операция.Субконто1 = Неопределено;
			Операция.Субконто2 = Неопределено;
			Операция.Субконто3 = Неопределено;
		КонецЕсли;
		
		ЭтоУвеличениеСальдоЕНС = ВидыОперацийУвеличениеСальдоЕНС.Найти(Операция.ВидОперации) <> Неопределено;
		Если ЭтоУвеличениеСальдоЕНС Тогда
			УвеличениеСальдо = УвеличениеСальдо + Операция.Сумма;
		Иначе
			УменьшениеСальдо = УменьшениеСальдо + Операция.Сумма;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	ПараметрыПроведения = Документы.КорректировкаЕНС.ПодготовитьПараметрыПроведения(
		Ссылка,
		Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ
	
	Документы.КорректировкаЕНС.СформироватьПроводки(ПараметрыПроведения.Реквизиты, Движения, Отказ);
	
	ПроведениеСервер.УстановитьЗаписьОчищаемыхНаборовЗаписей(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	НачалоПростогоУчета = ЕдиныйНалоговыйСчет.НачалоПростогоУчета();
	Если Дата < НачалоПростогоУчета Тогда
		 Дата = НачалоПростогоУчета;
	КонецЕсли;
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
